from sqlite3 import connect
from telethon.tl.functions.channels import GetParticipantsRequest
from telethon.tl.types import ChannelParticipantsSearch, InputChannel
import requests
ENV = 1
if ENV == 1:
    BOT_TOKEN = "7195801011:AAHGOtBVa9iGuAIeqBsu-dIBehwvh5ReXSU"
    API_ID = 28482138
    API_HASH = "cdcd9c0f111f85feaafac50d1bc3d6a5"
    PROXY = False
    ADMINS_LIST = [5415792594, 5136123873]
    CART = 6037697642714478
    merchant = "66378a97e7fe280012970bd3"
    sms_username = "9358037725"
    sms_password = "A72#L"
    sms_from = "50002710037725"
    pay_bot_username = "pardahkt_bot"
    lock_bot = 0 # 0
    BOT_ID = "https://t.me/SpeedConnectbot"
    CHANNEL_ID = 1947782337
    API_ADDRESS = f"http://127.0.0.1:8000/"
    panel_api_address = "https://app-panelmyqp.ir/get.php"
    MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"
else:
    BOT_TOKEN = "6383493043:AAG3I_ZMgdNQw97BR78r_EtBH55xtI5frLY"
    API_ID = 28482138
    API_HASH = "cdcd9c0f111f85feaafac50d1bc3d6a5"
    PROXY = True
    ADMINS_LIST = [5415792594]
    CART = 6037697642714478
    merchant = "zibal"
    sms_username = "9358037725"
    sms_password = "A72#L"
    sms_from = "50002710037725"
    pay_bot_username = "pays_test_test_bot"
    lock_bot = 0 # 0
    BOT_ID = "https://t.me/test_ro_bo_t_bot"
    CHANNEL_ID = "https://t.me/hoooosseinbot"
    API_ADDRESS = f"http://127.0.0.1:8000/"
    panel_api_address = "https://app-panelmyqp.ir/get.php"
    MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"

TEXT = {
    "start": "🤩به ربات خوش آمدید",
    "account": "👤حساب کاربری",
    "charge_account": "🔋شارژ حساب",
    "wallet": "💳 کیف پول",
    "back": "🔙بازگشت",
    "select": "👇لطفا دکمه مورد نظر خود را برای ادامه وارد کنید:👇",
    "phone_ok": "✅شماره شما با موفقیت ثبت شد!",
    "phone_no": "شماره تلفن تایید نشد❌",
    "phone_share": "📩اشتراک گذاری شماره",
    "pay_history": "📔تاریخچه پرداخت ها",
    "info": "ℹ️اطلاعات حساب",
    "user_id": "🆔آیدی عددی",
    "inventory_text": "💰موجودی به تومان",
    "phone_text": "🔢شماره ثبت شده",
    "zibal": "💶درگاه پرداخت",
    "cart": "💳کارت به کارت",
    "charge_text": "روش شارژ اکانت خود را انتخاب کنید👇",
    "enter_amount": "مبلغ را به تومان وارد کنید👇",
    "small_amount": "❕حداقل مبلغ قابل شارژ 10 هزار تومان میباشد",
    "big_amount": "❕حداکثر مبلغ قابل شارژ 5 میلیون تومان میباشد",
    "just_num": "فقط عدد وارد کنید❕",
    "name": "نام پرداخت کننده را وارد کنید👇",
    "phone": "شماره موبایل پرداخت کننده را وارد کنید👇",
    "dont_image": "❕به دلیل ارسال تصویر پرداخت لغو شد، لطفا دوباره تلاش کنید و تصویر ارسال نکنید",
    "zibal_problem": "مشکلی در ایجاد درگاه پرداخت وجود دارد!",
    "zibal_ok": """✅ فاکتور افزایش موجودی با مبلغ {amount} تومان با موفقیت برای شما ساخته شد
   
☑️ تمامی پرداخت ها به صورت اتوماتیک بوده و پس از تراکنش موفق مبلغ آن به موجودی حساب شما در ربات افزوده خواهد شد .

فاکتور فوق برای شماره همراه {phone} صادر شده است، در صورت تایید دکمه پرداخت را لمس نمایید.""",
    "zibal_confirmation": "پرداخت کردم",
    "zibal_pay_ok_wallet": """✅ تراکنش شما با #موفقیت #انجام #شد و موجودی حساب شما به مبلغ {amount} تومان افزایش یافت
👈 نوع پرداخت: {pay_type}
👈 مبلغ پرداخت شده : {amount_two} تومان
👈 موجودی جدید شما : {inventory} تومان
👈 زمان پرداخت : در ساعت {time}
👈 تاریخ پرداخت : {date}
👈 کد پیگیری : {code}

 این متن به عنوان رسید انقال وجه قابل استفاده می باشد✅""",
    "zibal_pay_ok": """✅ تراکنش شما با #موفقیت #انجام #شد
👈 نوع پرداخت: {pay_type}
👈 مبلغ پرداخت شده : {amount_two} تومان
👈 موجودی جدید شما : {inventory} تومان
👈 زمان پرداخت : در ساعت {time}
👈 تاریخ پرداخت : {date}
👈 کد پیگیری : {code}

 این متن به عنوان رسید انقال وجه قابل استفاده می باشد✅""",
    "zibal_conf_problem": "تایید درخواست موفقیت آمیز نبود!",
    "zibal_not_pay": "پرداخت انجام نشده است!",
    "direct": "مستقیم",
    "ask_pay_type": "نوع پرداخت را انتخاب کنید:",
    "cancel": "کنسل",
    "action_not_found": "حالت انتخابی معتبر نمیباشد!",
    "canceled": "با موفقیت کنسل شد!",
    "new_pay_zibal": """تراکنش جدید از طریق زیبال انجام شد:
    آیدی عددی کاربر : {user_id}
    اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان پرداخت : در ساعت {time}
    👈 تاریخ پرداخت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ پرداخت شده : {amount} تومان
    """,
    "cart_pay_created": """📍 شما روش پرداخت «واریز به کارت» را انتخاب کرده‌اید.

💴  لطفاً مبلغ «{amount} تومان» را به شماره کارت زیر واریز و سپس سند پرداخت را در ادامه ارسال کنید:

شماره کارت: 6037697642714478
به‌نام: شماره کارتی که در قسمت بالا درج شده مبلغ را واریز کنید""",
    "just_media": "فقط عکس ارسال کنید!",
    "cart_send_admin": "✅رسید شما برای ادمین ارسال شد، پس از تایید یا عدم تایید به شما اطلاع داده میشود",
    "new_pay_cart": """تراکنش جدید از طریق کارت به کارت انجام شد:
    آیدی عددی کاربر : {user_id}
    اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان پرداخت : در ساعت {time}
    👈 تاریخ پرداخت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ پرداخت شده : {amount} تومان
    """,
    "cart_conf": "تایید پرداخت✅",
    "cart_not_conf": "عدم تایید❌",
    "admin_pay_conf": "رسید با کد پیگیری {code} تایید شد✅",
    "user_pay_conf": """رسید شما به مبلغ {amount} تومان تایید شد\n    اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان پرداخت : در ساعت {time}
    👈 تاریخ پرداخت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ پرداخت شده : {amount_two} تومان""",
    "pay_not_found": "این پرداخت پیدا نشد!",
    "pay_before_conf": "پرداخت از قبل تایید شده است!",
    "wallet_withdraw": "برداشت از کیف پول",
    "none_inventory": "موجودی کیف پول شما برای برداشت این مقدار کافی نمیباشد!",
    "wallet_with_draw": """رسید برداشت شما به مبلغ {amount} تومان ایجاد شد\n اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان برداشت : در ساعت {time}
    👈 تاریخ برداشت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ برداشت شده : {amount_two} تومان""",
    "null_text": """\n اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان برداشت : در ساعت {time}
    👈 تاریخ برداشت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ برداشت شده : {amount_two} تومان""",
    "all_send": "ارسال همگانی",
    "question_image": "در صورت نیاز به تصویر ، تصویر را ارسال کنید در غیر این صورت متن مورد نظر را ارسال کنید:",
    "question_text": "متن مورد نظر را ارسال کنید:",
    "charge_wallet": "شارژ کیف پول",
    "pay_url": "پرداخت {amount} تومان - زیبال",
    "before_not_conf": "پرداخت از قبل عدم تایید شده است!",
    "admin_not_conf": "رسید با کد پیگیری {code} تایید نشد❌",
    "user_not_conf": "رسید شما با کد پیگیری {code} تایید نشد❌",
    "test_account": "🎁 • تست رایگان",
    "my_services": "🐉 اشترک های من",
    "new_service": "🚀خرید اشتراک جدید",
    "cant_make_service": "مشکلی در ایجاد اکانت وجود دارد! لطفا به پشتیبانی ربات اطلاع دهید\n @CONNECT_HELP",
    "before_test": "شما از قبل سرویس تست را دریافت کرده اید!",
    "panel": "پنل ادمین",
    "loading_test_account": "در حال ایجاد اکانت تست...",
    "one_member": "تک کاربره",
    "two_member": 'دو کاربره',
    "three_member": "سه کاربره",
    "pay": "پرداخت",
    "yes": "بله✅",
    "no": "خیر❌",
    "pay_wallet_sure": "آیا از خرید خود مطمئن هستید؟\nتمدید سرویس: {service}",
    "loading_account": "درحال ایجاد اکانت شما...",
    "pay_replay": """.
🔍 بررسی و تایید سفارش

🔗 اشتراک : {service}
💳 به مبلغ {amount} تومان

▫️نحوه‌ی پرداخت خود را انتخاب کنید :""",
"pay_link_replay": """.
🔍 بررسی و تایید سفارش

🔗 اشتراک : {service}
💳 به مبلغ {amount} تومان

در صورت تایید روی دکمه زیر کلیک کنید تا برای پرداخت به ربات پرداخت ها منتقل شوید:""",
    "pay_link_cart": "پرداخت با کارت",
    "pay_link_zibal": "پرداخت با درگاه زیبال",
    "ban_user": "مسدود کردن کاربر🛑",
    "enter_user_id": "آیدی عددی کاربر را وارد کنید:",
    "user_not_found": "کاربر پیدا نشد❌",
    "user_banned": "کاربر با موفقیت بن شد✅",
    "test_activated": "اکانت تست با موفقیت برای کاربر باز شد✅",
    "active_test": "باز کردن تست",
    "access_code": """#️⃣ کد کاربری: {access_code}

⛔️ شما دسترسی به پنل نمایندگان را ندارید

✅ جهت دریافت پنل نمایندگی و خرید عمده VPN با ادمین هماهنگ کنید

✅ آی دی ادمین جهت ارتباط:

🆔 @CONNECT_HELP""",
    "get_access": "قفل دسترسی",
    "su_get_access": "دسترسی برای کاربر با موفقیت آزاد شد✅",
    "enter_access_code": "کد دسترسی کاربر را وارد کنید👇",
    "install_help": "💡 آموزش نصب و استفاده",
    "for_install": "برای دریافت راهنمایی شیوه نصب و استفاده از اپلیکیشن Connectix ابتدا پلتفرم و سیستم‌عامل مدنظر خود را انتخاب کنید: 👇",
    "android": "✅Android",
    "soon": "این بخش به زودی اضافه خواهد شد✅",
    "windows": "✅Windows",
    "mac": "✅Mac",
    "ios": "✅IOS",
    "linux": "❌Linux(coming soon)",
    "android_help": """💡برای آموزش نصب Connectix در اندروید ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.):""",
    "windows_help": """💡برای آموزش نصب Connectix در ویندوز ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "mac_help": """💡برای آموزش نصب Connectix در Mac ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "ios_help": """💡برای آموزش نصب Connectix در IOS ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "download_app": "📲 دانلود اپلیکیشن",
    "download_help": """💎 اپلکیشن اختصاصی اسپید کانکت از طریق سایت رسمی برای انواع سیستم عامل ها قابل دانلود است .

لینک سایت رسمی ما :

www.speedconnect.space/#download""",
    "down_mac": """🔗 برای دانلود مستقیم نسخه Mac از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/mac/Connectix-1.3.2.zip""",
    "down_android": """🔗 برای دانلود مستقیم نسخه اندروید از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/android/connectix-2.2.1.apk
""",
    "down_ios": """برای نصب و استفاده از اپلیکیشن Speed Connect 2 ابتدا باید پیش‌نیاز آن یعنی نرم افزار Test Flight را از اپ استور اپل دانلود و نصب کنید و سپس مرحله دو را اجرا کنید.

لینک دانلود Test Flight:
https://testflight.apple.com/join/FQkEGDfX
 """,
    "down_windows": """🔗 برای دانلود مستقیم نسخه ویندوز از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/windows/Connectix-2.2.0.zip
""",
    "you_banned": "شما از ربات مسدود شده اید!",
    "pay_and_active": "پرداخت و دریافت سرویس✅",
    "get_buy": "🤝دریافت نمایندگی",
    "get_buy_text": """سپید کانکت، فراتر از یک شاپ! 🚀

📦 اگه فکر میکنی میتونی ، 😎 آیا مهارت فروش و بازاریابی خوبی دارید؟
📱 آیا موبایل فروشی دارید؟
👨‍👩‍👦‍👦 آیا در جمع فامیل، دوستان و آشنایان می‌توانید فروش VPN داشته باشید؟

💼 و یا آیا یک فروشنده VPN هستید و دنبال یک زیرساخت پرسرعت، بدون قطعی و مقیاس‌پذیر هستید؟

 این فرصت رو از دست نده و همین الان ربات نمایندگی خودت رو دریافت کن :

📊 از سرور ها و پشتیبانی تا فروش رو به عهده میگیرم تا یک درآمد ثابت براتون ایجاد کنیم!

📎 ثبت نام کن و نمایندگی بگیر :""",
    "support_text": "ثبت نام به عنوان نماینده🧑‍💻",
    "not_service": """اشتراک فعالی نداری☹️
نظرت چیه یدونه بگیریم؟""",
    "go_buy": "بزن بریم یدونه بخریم! :)",
    "admin_service_notif": """نام اشتراک خریداری شده : {service_name} 
رمز عبور اشتراک خریداری شده : {service_password}
نام فرد : {user_name} 
ایدی عددی فرد : {user_id}
نام کاربری فرد : {username}
موجودی باقیمانده فرد : {user_inventory}
شماره تلفن فرد : {user_phone}
""",
    "user_info_panel": "اطلاعات کاربر",
    "user_info_content": """نام کاربری فرد : {username}
نام فرد: {user_name}
شماره فرد : {user_phone}
موجودی فرد : {user_inventory}
تعداد اشتراک: {service_count}
""",
    "admin_service_notif_iphone":  """نام اشتراک خریداری شده : {service_name}
نام فرد : {user_name} 
ایدی عددی فرد : {user_id}
نام کاربری فرد : {username}
موجودی باقیمانده فرد : {user_inventory}
شماره تلفن فرد : {user_phone}
لینک اشتراک : {sub_link}
""",
    "user_info_panel": "اطلاعات کاربر",
    "user_info_content": """نام کاربری فرد : {username}
نام فرد: {user_name}
شماره فرد : {user_phone}
موجودی فرد : {user_inventory}
تعداد اشتراک: {service_count}
""",
    "down_inventory": "کم کردن موجودی",
    "up_inventory": "افزایش موجودی",
    "su_down": "موجودی مورد نظر با موفقیت از حساب کاربر کم شد✅",
    "su_up": "موجودی مورد نظر با موفقیت به حساب فرد اضافه شد✅",
    "user_null_inventory": "موجودی کاربر برای کم کردن این مقدار کافی نمیباشد!",
    "user_services": "سرویس های کاربر",
    "user_dont_service": "کاربر تا به حال سرویسی خریداری نکرده است",
    "Membership_Confirmation": "تایید عضویت",
    "pls_join": "برای استفاده از ربات ابتدا در کانال زیر عضو شوید سپس دوباره استارت کنید",
    "service_extension": "⚡️تمدید سرویس",
    "service_not_found": "❕این سرویس پیدا نشد",
    "cant_request_info": "مشکلی در پیدا کردن اطلاعات سرویس به وجود آمده است!\nلطفا به پشتیبانی پیام دهید: @CONNECT_HELP",
    "select_ex_plan": "تعداد کاربر را برای تمدید سرویس انتخاب کنید:",
    "pay_and_active_ex": "پرداخت و تمدید سرویس✅",
    "pay_replay_ex": """.
🔍 بررسی و تایید سفارش

🔗 تمدید اشتراک : {service}
💳 به مبلغ {amount} تومان

▫️نحوه‌ی پرداخت خود را انتخاب کنید :""",
    "ss_ex": "سرویس شما با موفقیت تمدید شد✅",
    "ss_ex_marzban": "سرویس شما با موفقیت تمدید شد✅\nلینک اشتراک: {sub}",
    "enter_service_username": "نام کاربری سرویس مورد نظر جهت تمدید را وارد کنید:",
    "enter_service_password": "پسورد سرویس را وارد کنید:",
    "password_invalid": "پسورد سرویس اشتباه است!",
    "service_info": "📊مشخصات سرویس",
    "connected_pep": "🧬افراد متصل",
    "sub_link": "📍دریافت لینک ساب v2ray",
    "outline": "🧨دریافت خروجی اوتلاین",
    "pay_war": """👤 **شناسه کاربری**: {user_id}

📞 **شماره تلفن** : {phone}

📌 **اعتبار کیف پول شما**: {inventory} تومان

✅ جهت شارژ کیف پول، لطفا یکی از روش های پرداخت را انتخاب کنید

🤝 در شارژ کیف پول خود دقت کنید، زیرا بازگشت وجهی صورت نمیگیرد و تنها در صورت پرداخت ناموفق وجه برگشت داده میشود

🆔 @SpeedConnectbot""",
    "user_info_text": """👤 شناسه کاربری: {user_id}
💰 موجودی {inventory} تومان
🟢 پرداخت های موفق : `{ok_pay} عدد`
🟡 پرداخت های ناموفق : `{no_pay} عدد`
📦 کل سرویس ها : `{sr} عدد`
📞 شماره تلفن : {phone}""",
    "premium_account": "خرید اکانت اختصاصی",
    "iphone_account": "خرید اکانت آیفون",
    "no_device_found": "دستگاهی پیدا نشد!",
    "vip_info": "اکانت های اختصاصی",
    "iphone_info": "اکانت های آیفون",
    "change_service_to_iphone": "تعویض اکانت به آیفون",
    "change_iphone": "تغییر اکانت به آیفون (کصکش)",
    "enter_serv_username": "نام کاربری سرور اختصاصی رو وارد کن کصکش:",
    "vip_extension": "تمدید سرویس اختصاصی",
    "iphone_extension": "تمدید سرویس آیفون",
}

async def join_check(user_id, cli):
    get_info = await cli.get_entity(CHANNEL_ID)
    TELEGRAM_API_URL = f"https://api.telegram.org/bot{BOT_TOKEN}/getChatMember?chat_id=-1001947782337&user_id={user_id}"
    response = requests.post(TELEGRAM_API_URL)
    response = response.json()
    print(response)
    response = response.get("ok")
    return response, get_info
def is_iran_phone_number(phone_number):
    print(phone_number)
    if phone_number.startswith('+98') or phone_number.startswith("98"):
        return True
    else:
        return False
def is_ban(user_id):
    db = connect("bot.db")
    cur = db.cursor()
    user_is_ban = cur.execute(f"SELECT is_ban FROM users WHERE user_id = {user_id}").fetchone()
    if user_is_ban == None:
        return None
    else:
        return user_is_ban[0]
    db.close()
    return user_is_ban


one_member_names = {
    2: "20 گیگ - 1 ماهه - 60,000 تومان",
    3: "30 گیگ - 1 ماهه - 80,000 تومان",
    4: "50 گیگ - 1 ماهه - 100,000 تومان",
    5: "نامحدود - 1 ماهه - 120,000 تومان",
    6: "60 گیگ - 2 ماهه - 150,000 تومان",
    7: "80 گیگ - 2 ماهه - 180,000 تومان",
    8: "100 گیگ - 2 ماهه - 200,000 تومان",
    9: "نامحدود - 2 ماهه - 220,000 تومان",
    10: "150 گیگ - 3 ماهه - 240,000 تومان",
    11: "200 گیگ - 3 ماهه - 270,000 تومان",
    12: "300 گیگ - 3 ماهه - 300,000 تومان",
    13: "نامحدود - 3 ماهه - 320,000 تومان",
}

two_member_names = {
    14: "60 گیگ - 2 ماهه - 160,000 تومان",
    15: "80 گیگ - 2 ماهه - 180,000 تومان",
    16: "100 گیگ - 2 ماهه - 210,000 تومان",
    17: "نامحدود - 2 ماهه - 310,000 تومان",
    18: "150 گیگ - 3 ماهه - 290,000 تومان",
    19: "200 گیگ - 3 ماهه - 340,000 تومان",
    20: "300 گیگ - 3 ماهه - 380,000 تومان",
    21: "نامحدود - 3 ماهه - 410,000 تومان",
}

three_member_names = {
    22: "60 گیگ - 2 ماهه - 160,000 تومان",
    23: "80 گیگ - 2 ماهه - 190,000 تومان",
    24: "100 گیگ - 2 ماهه - 220,000 تومان",
    25: "نامحدود - 2 ماهه - 390,000 تومان",
    26: "150 گیگ - 3 ماهه - 310,000 تومان",
    27: "200 گیگ - 3 ماهه - 340,000 تومان",
    28: "300 گیگ - 3 ماهه - 400,000 تومان",
    29: "نامحدود - 3 ماهه - 490,000 تومان"
}


one_member_namesـiphone = {
    2: "20 گیگ - 1 ماهه - 60,000 تومان",
    3: "30 گیگ - 1 ماهه - 80,000 تومان",
    4: "50 گیگ - 1 ماهه - 100,000 تومان",
    5: "60 گیگ - 2 ماهه - 150,000 تومان",
    6: "80 گیگ - 2 ماهه - 180,000 تومان",
    7: "100 گیگ - 2 ماهه - 200,000 تومان",
    8: "150 گیگ - 3 ماهه - 240,000 تومان",
    9: "200 گیگ - 3 ماهه - 270,000 تومان",
    10: "300 گیگ - 3 ماهه - 300,000 تومان",
}

two_member_names_iphone = {
    11: "60 گیگ - 2 ماهه - 160,000 تومان",
    12: "80 گیگ - 2 ماهه - 180,000 تومان",
    13: "100 گیگ - 2 ماهه - 210,000 تومان",
    14: "150 گیگ - 3 ماهه - 290,000 تومان",
    15: "200 گیگ - 3 ماهه - 340,000 تومان",
    16: "300 گیگ - 3 ماهه - 380,000 تومان",
}

three_member_names_iphone = {
    17: "60 گیگ - 2 ماهه - 160,000 تومان",
    18: "80 گیگ - 2 ماهه - 190,000 تومان",
    19: "100 گیگ - 2 ماهه - 220,000 تومان",
    20: "150 گیگ - 3 ماهه - 310,000 تومان",
    21: "200 گیگ - 3 ماهه - 340,000 تومان",
    22: "300 گیگ - 3 ماهه - 400,000 تومان",
}

amounts = {
    2: 60000,
    3: 80000,
    4: 100000,
    5: 120000,
    6: 150000,
    7: 180000,
    8: 200000,
    9: 220000,
    10: 240000,
    11: 270000,
    12: 300000,
    13: 320000,
    14: 160000,
    15: 180000,
    16: 210000,
    17: 310000,
    18: 290000,
    19: 340000,
    20: 380000,
    21: 410000,
    22: 160000,
    23: 190000,
    24: 220000,
    25: 390000,
    26: 310000,
    27: 340000,
    28: 400000,
    29: 490000
}


iphone_amounts = {
    2: 60000,
    3: 80000,
    4: 100000,
    5: 150000,
    6: 180000,
    7: 200000,
    8: 240000,
    9: 270000,
    10: 300000,
    11: 160000,
    12: 180000,
    13: 210000,
    14: 290000,
    15: 340000,
    16: 380000,
    17: 160000,
    18: 190000,
    19: 220000,
    20: 310000,
    21: 340000,
    22: 400000,
}



iphone_data_limits = {2: 21474836480, 3: 32212254720, 4: 53687091200, 5: 64424509440, 6: 85899345920, 7: 107374182400, 8: 161061273600, 9: 214748364800, 10: 322122547200, 11: 64424509440, 12: 85899345920, 13: 107374182400, 14: 161061273600, 15: 214748364800, 16: 322122547200, 17: 64424509440, 18: 85899345920, 19: 107374182400, 20: 161061273600, 21: 214748364800, 1: 1073741824, 22: 322122547200}


iphone_plan_names = {
    2: "20 گیگ - 1 ماهه - 60,000 تومان",
    3: "30 گیگ - 1 ماهه - 80,000 تومان",
    4: "50 گیگ - 1 ماهه - 100,000 تومان",
    5: "60 گیگ - 2 ماهه - 150,000 تومان",
    6: "80 گیگ - 2 ماهه - 180,000 تومان",
    7: "100 گیگ - 2 ماهه - 200,000 تومان",
    8: "150 گیگ - 3 ماهه - 240,000 تومان",
    9: "200 گیگ - 3 ماهه - 270,000 تومان",
    10: "300 گیگ - 3 ماهه - 300,000 تومان",
    11: "60 گیگ - 2 ماهه - 160,000 تومان",
    12: "80 گیگ - 2 ماهه - 180,000 تومان",
    13: "100 گیگ - 2 ماهه - 210,000 تومان",
    14: "150 گیگ - 3 ماهه - 290,000 تومان",
    15: "200 گیگ - 3 ماهه - 340,000 تومان",
    16: "300 گیگ - 3 ماهه - 380,000 تومان",
    17: "60 گیگ - 2 ماهه - 160,000 تومان",
    18: "80 گیگ - 2 ماهه - 190,000 تومان",
    19: "100 گیگ - 2 ماهه - 220,000 تومان",
    20: "150 گیگ - 3 ماهه - 310,000 تومان",
    21: "200 گیگ - 3 ماهه - 340,000 تومان",
    22: "300 گیگ - 3 ماهه - 400,000 تومان",
}

iphone_expire_dates = {
    2: 30,
    3: 30,
    4: 30,
    5: 60,
    6: 60,
    7: 60,
    8: 90,
    9: 90,
    10: 90,
    11: 60,
    12: 60,
    13: 60,
    14: 90,
    15: 90,
    16: 90,
    17: 60,
    18: 60,
    19: 60,
    20: 90,
    21: 90,
    22: 90,
}


plans_json = {
    1: "88db7ac0-6baf-4028-8948-6b4ce7dada60",
    2: "2492da1c-abfb-4978-99c9-0f5d9f75bf8d",
    3: "681c0977-fc70-4345-b51e-84a8dc734f6f",
    4: "de82caf4-4f08-4c61-afd7-547fd0554da6",
    5: "a53e4e62-96d0-4b5d-90a6-71723839a2b7",
    6: "a180cf18-3fc6-4d58-9fe0-a7ffb9aaaed6",
    7: "1226e5c2-326b-4ee4-8d09-2b19f1fe3c72",
    8: "5bdde050-e0dc-40ff-a766-d736c40d26ba",
    9: "625b6a0a-d789-4b65-8a75-ddf0c7364d9c",
    10: "1ed7fdc6-5ed2-464e-a5d8-5a085157bed7",
    11: "9a4869ff-05c7-4f3c-abec-f04c550be9a0",
    12: "517f6f5e-a054-431a-9689-ffa2266bec0c",
    13: "dd5813f9-1647-48c9-a700-941868e9742e",
    14: "6d2fa322-6770-4821-b8ef-5a8dcceadad9",
    15: "b923d70c-26bd-4a12-a3a6-8704d7494c31",
    16: "8cdec062-157e-4121-9d46-f291d26a856c",
    17: "391b01f9-b39f-43f1-a91b-23b09fe3f0f8",
    18: "355cfc20-10ef-4516-abf1-b87b64a6a8fd",
    19: "62117254-42c8-47a0-aba6-351dd9839446",
    20: "e9c1aaa7-0f55-4d07-b2e4-2a56f6d277d4",
    21: "4d79e0da-ae2b-42d6-a5bc-e531fe40402a",
    22: "1502637f-5ae7-485b-b70f-59dbf1f06c44",
    23: "7b5f87eb-f2bd-4d8b-a32b-19a2bb51035b"
}