from sqlite3 import connect
from telethon.tl.functions.channels import GetParticipantsRequest
from telethon.tl.types import PeerChannel
import requests

ENV = 0
if ENV == 1:
    BOT_TOKEN = "7195801011:AAHGOtBVa9iGuAIeqBsu-dIBehwvh5ReXSU"
    API_ID = 28482138
    API_HASH = "cdcd9c0f111f85feaafac50d1bc3d6a5"
    PROXY = False
    ADMINS_LIST = [5415792594, 5136123873]
    CART = 6037697642714478
    merchant = "66378a97e7fe280012970bd3"
    sms_username = "9358037725"
    sms_password = "A72#L"
    sms_from = "50002710037725"
    pay_bot_username = "pardahkt_bot"
    lock_bot = 0  # 0
    BOT_ID = "https://t.me/SpeedConnectbot"
    CHANNEL_ID = 1947782337
    API_ADDRESS = f"http://127.0.0.1:8000/"
    panel_api_address = "https://app-panelmyqp.ir/get.php"
    MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"
    min_amount = 50000
    zarinpal_link = "https://zarinp.al/691588"
else:
    BOT_TOKEN = "6383493043:AAG3I_ZMgdNQw97BR78r_EtBH55xtI5frLY"
    API_ID = 28482138
    API_HASH = "cdcd9c0f111f85feaafac50d1bc3d6a5"
    PROXY = False
    ADMINS_LIST = [5415792594]
    CART = 6037697642714478
    merchant = "zibal"
    sms_username = "9358037725"
    sms_password = "A72#L"
    sms_from = "50002710037725"
    pay_bot_username = "pays_test_test_bot"
    lock_bot = 0  # 0
    BOT_ID = "https://t.me/test_ro_bo_t_bot"
    CHANNEL_ID = "https://t.me/hoooosseinbot"
    API_ADDRESS = f"http://127.0.0.1:8001/"
    panel_api_address = "https://app-panelmyqp.ir/get.php"
    MARZBAN_API_URL = f"https://panel.panelmarzban.com/api/"
    min_amount = 50000
    zarinpal_link = "https://zarinp.al/691588"
TEXT = {
    "start": "🤩به ربات خوش آمدید",
    "account": "👤حساب کاربری",
    "charge_account": "🔋شارژ حساب",
    "wallet": "🏦 کیف پول + شارژ",
    "back": "🔙بازگشت",
    "select": "👇لطفا دکمه مورد نظر خود را برای ادامه وارد کنید:👇",
    "select_pay_type": "💵 روش پرداخت خود را انتخاب نمایید",
    "select_service_extension": "📌 سرویس خود را جهت تمدید انتخاب نمایید.",
    "phone_ok": "✅شماره شما با موفقیت ثبت شد!",
    "phone_no": "شماره تلفن تایید نشد❌",
    "phone_share": "📩اشتراک گذاری شماره",
    "pay_history": "📔تاریخچه پرداخت ها",
    "info": "ℹ️اطلاعات حساب",
    "user_id": "🆔آیدی عددی",
    "inventory_text": "💰موجودی به تومان",
    "phone_text": "🔢شماره ثبت شده",
    "zibal": "💶درگاه پرداخت",
    "cart": "💳کارت به کارت",
    "charge_text": "روش شارژ اکانت خود را انتخاب کنید👇",
    "enter_amount": """💸 مبلغ را  به تومان وارد کنید:
✅  حداقل مبلغ 50,000 حداکثر مبلغ 10,000,000 تومان می باشد""",
    "small_amount": """❌ خطا 
💬 مبلغ باید حداقل 50,000 تومان و حداکثر 10,000,000 تومان باشد""",
    "big_amount": """❌ خطا 
💬 مبلغ باید حداقل 50,000 تومان و حداکثر 10,000,000 تومان باشد""",
    "just_num": "فقط عدد وارد کنید❕",
    "name": "نام پرداخت کننده را وارد کنید👇",
    "phone": "شماره موبایل پرداخت کننده را وارد کنید👇",
    "dont_image": "❕به دلیل ارسال تصویر پرداخت لغو شد، لطفا دوباره تلاش کنید و تصویر ارسال نکنید",
    "zibal_problem": "مشکلی در ایجاد درگاه پرداخت وجود دارد!",
    "zibal_ok": """✅ فاکتور افزایش موجودی با مبلغ {amount} تومان با موفقیت برای شما ساخته شد
   
☑️ تمامی پرداخت ها به صورت اتوماتیک بوده و پس از تراکنش موفق مبلغ آن به موجودی حساب شما در ربات افزوده خواهد شد .

فاکتور فوق برای شماره همراه {phone} صادر شده است، در صورت تایید دکمه پرداخت را لمس نمایید.""",
    "zibal_confirmation": "پرداخت کردم",
    "zibal_pay_ok_wallet": """✅ تراکنش شما با #موفقیت #انجام #شد و موجودی حساب شما به مبلغ {amount} تومان افزایش یافت
👈 نوع پرداخت: {pay_type}
👈 مبلغ پرداخت شده : {amount_two} تومان
👈 موجودی جدید شما : {inventory} تومان
👈 زمان پرداخت : در ساعت {time}
👈 تاریخ پرداخت : {date}
👈 کد پیگیری : {code}

 این متن به عنوان رسید انقال وجه قابل استفاده می باشد✅""",
    "zibal_pay_ok": """✅ تراکنش شما با #موفقیت #انجام #شد
👈 نوع پرداخت: {pay_type}
👈 مبلغ پرداخت شده : {amount_two} تومان
👈 موجودی جدید شما : {inventory} تومان
👈 زمان پرداخت : در ساعت {time}
👈 تاریخ پرداخت : {date}
👈 کد پیگیری : {code}

 این متن به عنوان رسید انقال وجه قابل استفاده می باشد✅""",
    "zibal_conf_problem": "تایید درخواست موفقیت آمیز نبود!",
    "zibal_not_pay": "پرداخت انجام نشده است!",
    "direct": "مستقیم",
    "ask_pay_type": "نوع پرداخت را انتخاب کنید:",
    "cancel": "کنسل",
    "action_not_found": "حالت انتخابی معتبر نمیباشد!",
    "canceled": "با موفقیت کنسل شد!",
    "new_pay_zibal": """تراکنش جدید از طریق زیبال انجام شد:
    آیدی عددی کاربر : {user_id}
    اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان پرداخت : در ساعت {time}
    👈 تاریخ پرداخت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ پرداخت شده : {amount} تومان
    """,
    "cart_pay_created": """
    برای تایید فوری لطفا دقیقاً مبلغ زیر واریز شود. در غیر این صورت تایید پرداخت شما ممکن است با تاخیر مواجه شود.⚠️
            برای افزایش موجودی، مبلغ `{amount}` ریال  را به شماره‌ی حساب زیر واریز کنید 👇🏻

        ==================== 
        `{cart}`
        هر نامی که در همراه بانک شما درج شده یعنی دارنده کارت همون هست
        ====================
        ‼️امکان برداشت وجه از کیف پول نیست.
        
        ✅بعد از پرداخت رسید را ارسال کنید👇
    """,
    "zarinpal_pay_created": """✅ تراکنش شما ایجاد شد
🛒 کد پیگیری:  {code}

💳 آدرس لینک درگاه :

{link}

📌 مبلغ  {amount}  تومان را از طریق لینک درگاه بالا واریز پس از واریز دکمه زیر را کلیک و رسید را ارسال نمایید

✅ در صورت مشکل میتوانید با پشتیبانی در ارتباط باشید""",
    "just_media": "فقط عکس ارسال کنید!",
    "cart_send_admin": "✅رسید شما برای ادمین ارسال شد، پس از تایید یا عدم تایید به شما اطلاع داده میشود",
    "new_pay_cart": """
⭕️ یک پرداخت جدید انجام شده است .
افزایش موجودی            
👤 نام اکانت کاربر : {name}
👤 شناسه کاربر:  {user_id}
⚜️ نام کاربری: {username}
💸 مبلغ پرداختی: {amount} تومان
📱شماره تلفن: {phone}
توضیحات: 
✍️ در صورت درست بودن رسید پرداخت را تایید نمایید.
""",
    "cart_conf": "تایید پرداخت✅",
    "cart_not_conf": "عدم تایید❌",
    "admin_pay_conf": "رسید با کد پیگیری {code} تایید شد✅",
    "user_pay_conf": """رسید شما به مبلغ {amount} تومان تایید شد\n    اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان پرداخت : در ساعت {time}
    👈 تاریخ پرداخت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ پرداخت شده : {amount_two} تومان""",
    "user_pay_conf_new": "💎 کاربر گرامی مبلغ {amount} تومان به کیف پول شما واریز گردید با تشکراز پرداخت شما.",
    "pay_not_found": "این پرداخت پیدا نشد!",
    "pay_before_conf": "پرداخت از قبل تایید شده است!",
    "wallet_withdraw": "برداشت از کیف پول",
    "none_inventory": "📝 موجودی حساب شما کافی نمی باشد لطفا ابتدا کیف پول خود را شارژ کنید",
    "wallet_with_draw": """رسید برداشت شما به مبلغ {amount} تومان ایجاد شد\n اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان برداشت : در ساعت {time}
    👈 تاریخ برداشت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ برداشت شده : {amount_two} تومان""",
    "null_text": """\n اطلاعات تراکنش:
    نوع پرداخت: {pay_type}
    توضیحات: {name}
    شماره تلفن: {phone}
    اطلاعات فاکتور:
    👈 زمان برداشت : در ساعت {time}
    👈 تاریخ برداشت : {date}
    👈 کد پیگیری : {code}
    👈 مبلغ برداشت شده : {amount_two} تومان""",
    "all_send": "ارسال همگانی",
    "question_image": "در صورت نیاز به تصویر ، تصویر را ارسال کنید در غیر این صورت متن مورد نظر را ارسال کنید:",
    "question_text": "متن مورد نظر را ارسال کنید:",
    "charge_wallet": "شارژ کیف پول",
    "pay_url": "پرداخت {amount} تومان - زیبال",
    "before_not_conf": "پرداخت از قبل عدم تایید شده است!",
    "admin_not_conf": "رسید با کد پیگیری {code} تایید نشد❌",
    "user_not_conf": "رسید شما با کد پیگیری {code} تایید نشد❌",
    "test_account": "🎁 • تست رایگان",
    "my_services": "🐉 اشتراک های من",
    "new_service": "🚀خرید اشتراک جدید",
    "cant_make_service": "مشکلی در ایجاد اکانت وجود دارد! لطفا به پشتیبانی ربات اطلاع دهید\n @CONNECT_HELP",
    "before_test": "شما از قبل سرویس تست را دریافت کرده اید!",
    "panel": "پنل ادمین",
    "loading_test_account": "در حال ایجاد اکانت تست...",
    "one_member": "تک کاربره",
    "two_member": 'دو کاربره',
    "three_member": "سه کاربره",
    "pay": "پرداخت",
    "yes": "بله✅",
    "no": "خیر❌",
    "pay_wallet_sure": "آیا از خرید خود مطمئن هستید؟\nتمدید سرویس: {service}",
    "loading_account": "درحال ایجاد اکانت شما...",
    "pay_replay": """
    📇 پیش فاکتور شما:
🔐 نام سرویس: {service_name}
📆 مدت اعتبار: {days} روز
💶 قیمت:  {amount} تومان
👥 حجم اکانت: {data_limit} گیگ
💵 موجودی کیف پول شما : {inventory}
          
💰 سفارش شما آماده پرداخت است

    """,
    "pay_link_replay": """.
🔍 بررسی و تایید سفارش

🔗 اشتراک : {service}
💳 به مبلغ {amount} تومان

در صورت تایید روی دکمه زیر کلیک کنید تا برای پرداخت به ربات پرداخت ها منتقل شوید:""",
    "pay_link_cart": "💳 کارت به کارت",
    "pay_link_zibal": "🥇درگاه آنلاین",
    "ban_user": "مسدود کردن کاربر🛑",
    "enter_user_id": "آیدی عددی کاربر را وارد کنید:",
    "user_not_found": "کاربر پیدا نشد❌",
    "user_banned": "کاربر با موفقیت بن شد✅",
    "test_activated": "اکانت تست با موفقیت برای کاربر باز شد✅",
    "active_test": "باز کردن تست",
    "access_code": """#️⃣ کد کاربری: {access_code}

⛔️ شما دسترسی به پنل نمایندگان را ندارید

✅ جهت دریافت پنل نمایندگی و خرید عمده VPN با ادمین هماهنگ کنید

✅ آی دی ادمین جهت ارتباط:

🆔 @CONNECT_HELP""",
    "get_access": "قفل دسترسی",
    "su_get_access": "دسترسی برای کاربر با موفقیت آزاد شد✅",
    "enter_access_code": "کد دسترسی کاربر را وارد کنید👇",
    "install_help": "💡 آموزش نصب و استفاده",
    "for_install": "برای دریافت راهنمایی شیوه نصب و استفاده از اپلیکیشن Connectix ابتدا پلتفرم و سیستم‌عامل مدنظر خود را انتخاب کنید: 👇",
    "android": "✅Android",
    "soon": "این بخش به زودی اضافه خواهد شد✅",
    "windows": "✅Windows",
    "un_ban": "آن بن(کیرم تو کص زنت)",
    "un_banned": "کاربر آن بن شد، ریدم دهنت کونی این بخشو اضافه کردی",
    "mac": "✅Mac",
    "ios": "✅IOS",
    "linux": "❌Linux(coming soon)",
    "android_help": """💡برای آموزش نصب Connectix در اندروید ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.):""",
    "windows_help": """💡برای آموزش نصب Connectix در ویندوز ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "mac_help": """💡برای آموزش نصب Connectix در Mac ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "ios_help": """💡برای آموزش نصب Connectix در IOS ویدئوی آموزش زیر را مشاهده کنید:

(نکته: پخش ویدئو ممکن است کمی طول بکشد. لطفاً صبور باشید.)""",
    "download_app": "📲 دانلود اپلیکیشن",
    "download_site": "دانلود از طریق سایت رسمی",
    "download_channel": "دانلود از طریق کانال اصلی",
    "download_site_select": """
💎 اپلکیشن اختصاصی اسپید کانکت از طریق سایت رسمی برای انواع سیستم عامل ها قابل دانلود است .

لینک سایت رسمی ما :
www.speedconnect.space/#download
""",
    "download_channel_select": """
💎 اپلکیشن اختصاصی اسپید کانکت از طریق کانال  رسمی برای انواع سیستم عامل ها قابل دانلود است .

دانلود از طریق کانال تلگرام رسمی:
https://t.me/SpeedConnectapp
""",
    "download_help": """💎 اپلکیشن اختصاصی اسپید کانکت از طریق سایت رسمی برای انواع سیستم عامل ها قابل دانلود است .
دانلود از طریق کانال تلگرام رسمی:
https://t.me/SpeedConnectapp
لینک سایت رسمی ما :
www.speedconnect.space/#download""",
    "down_mac": """🔗 برای دانلود مستقیم نسخه Mac از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/mac/Connectix-1.3.2.zip""",
    "down_android": """🔗 برای دانلود مستقیم نسخه اندروید از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/android/connectix-2.2.1.apk
""",
    "down_ios": """برای نصب و استفاده از اپلیکیشن Speed Connect 2 ابتدا باید پیش‌نیاز آن یعنی نرم افزار Test Flight را از اپ استور اپل دانلود و نصب کنید و سپس مرحله دو را اجرا کنید.

لینک دانلود Test Flight:
https://testflight.apple.com/join/FQkEGDfX
 """,
    "down_windows": """🔗 برای دانلود مستقیم نسخه ویندوز از لینک‌های زیر اقدام کنید: 

لینک دانلود سریع: https://apps.irancdn.org/windows/Connectix-2.2.0.zip
""",
    "you_banned": "شما از ربات مسدود شده اید!",
    "pay_and_active": "💰 پرداخت و دریافت سرویس",
    "get_buy": "🤝دریافت نمایندگی",
    "get_buy_text": """سپید کانکت، فراتر از یک شاپ! 🚀

📦 اگه فکر میکنی میتونی ، 😎 آیا مهارت فروش و بازاریابی خوبی دارید؟
📱 آیا موبایل فروشی دارید؟
👨‍👩‍👦‍👦 آیا در جمع فامیل، دوستان و آشنایان می‌توانید فروش VPN داشته باشید؟

💼 و یا آیا یک فروشنده VPN هستید و دنبال یک زیرساخت پرسرعت، بدون قطعی و مقیاس‌پذیر هستید؟

 این فرصت رو از دست نده و همین الان ربات نمایندگی خودت رو دریافت کن :

📊 از سرور ها و پشتیبانی تا فروش رو به عهده میگیرم تا یک درآمد ثابت براتون ایجاد کنیم!

📎 ثبت نام کن و نمایندگی بگیر :""",
    "support_text": "ثبت نام به عنوان نماینده🧑‍💻",
    "not_service": """اشتراک فعالی نداری☹️
نظرت چیه یدونه بگیریم؟""",
    "go_buy": "بزن بریم یدونه بخریم! :)",
    "admin_service_notif": """نام اشتراک خریداری شده : {service_name} 
رمز عبور اشتراک خریداری شده : {service_password}
نام فرد : {user_name} 
ایدی عددی فرد : {user_id}
نام کاربری فرد : {username}
موجودی باقیمانده فرد : {user_inventory}
شماره تلفن فرد : {user_phone}
""",
    "user_info_panel": "اطلاعات کاربر",
    "user_info_content": """نام کاربری فرد : {username}
نام فرد: {user_name}
شماره فرد : {user_phone}
موجودی فرد : {user_inventory}
تعداد اشتراک: {service_count}
""",
    "admin_service_notif_iphone": """نام اشتراک خریداری شده : {service_name}
نام فرد : {user_name} 
ایدی عددی فرد : {user_id}
نام کاربری فرد : {username}
موجودی باقیمانده فرد : {user_inventory}
شماره تلفن فرد : {user_phone}
لینک اشتراک : {sub_link}
""",
    "user_info_panel": "اطلاعات کاربر",
    "user_info_content": """نام کاربری فرد : {username}
نام فرد: {user_name}
شماره فرد : {user_phone}
موجودی فرد : {user_inventory}
تعداد اشتراک: {service_count}
""",
    "down_inventory": "کم کردن موجودی",
    "up_inventory": "افزایش موجودی",
    "su_down": "موجودی مورد نظر با موفقیت از حساب کاربر کم شد✅",
    "su_up": "موجودی مورد نظر با موفقیت به حساب فرد اضافه شد✅",
    "user_null_inventory": "موجودی کاربر برای کم کردن این مقدار کافی نمیباشد!",
    "user_services": "سرویس های کاربر",
    "user_dont_service": "کاربر تا به حال سرویسی خریداری نکرده است",
    "Membership_Confirmation": "تایید عضویت",
    "pls_join": "برای استفاده از ربات ابتدا در کانال زیر عضو شوید سپس دوباره استارت کنید",
    "service_extension": "⚡️تمدید سرویس",
    "service_not_found": "❕این سرویس پیدا نشد",
    "cant_request_info": "مشکلی در پیدا کردن اطلاعات سرویس به وجود آمده است!\nلطفا به پشتیبانی پیام دهید: @CONNECT_HELP",
    "select_ex_plan": "تعداد کاربر را برای تمدید سرویس انتخاب کنید:",
    "pay_and_active_ex": "پرداخت و تمدید سرویس✅",
    "pay_replay_ex": """.
🔍 بررسی و تایید سفارش

🔗 تمدید اشتراک : {service}
💳 به مبلغ {amount} تومان

▫️نحوه‌ی پرداخت خود را انتخاب کنید :""",
    "ss_ex": "سرویس شما با موفقیت تمدید شد✅",
    "ss_ex_marzban": "سرویس شما با موفقیت تمدید شد✅\nلینک اشتراک: {sub}",
    "enter_service_username": "نام کاربری سرویس مورد نظر جهت تمدید را وارد کنید:",
    "enter_service_password": "پسورد سرویس را وارد کنید:",
    "password_invalid": "پسورد سرویس اشتباه است!",
    "service_info": "📊مشخصات سرویس",
    "connected_pep": "🧬افراد متصل",
    "sub_link": "📍دریافت لینک ساب v2ray",
    "outline": "🧨دریافت خروجی اوتلاین",
    "pay_war": """
🗂 اطلاعات حساب کاربری شما :


‏🪪 شناسه کاربری: `{user_id}`
👤 نام: {name}
📱 شماره تماس : {phone}
💰 موجودی: {inventory} تومان
🛒 تعداد سرویس های خریداری شده : {service_count} عدد
🔖 گروه کاربری : {group}
""",
    "user_info_text": """👤 شناسه کاربری: {user_id}
💰 موجودی {inventory} تومان
🟢 پرداخت های موفق : `{ok_pay} عدد`
🟡 پرداخت های ناموفق : `{no_pay} عدد`
📦 کل سرویس ها : `{sr} عدد`
📞 شماره تلفن : {phone}""",
    "premium_account": "خرید اکانت اختصاصی",
    "iphone_account": "خرید اکانت آیفون",
    "no_device_found": "دستگاهی پیدا نشد!",
    "vip_info": "اکانت های اختصاصی",
    "iphone_info": "اکانت های آیفون",
    "change_service_to_iphone": "تعویض اکانت به آیفون",
    "change_iphone": "تغییر اکانت به آیفون (کصکش)",
    "enter_serv_username": "نام کاربری سرور اختصاصی رو وارد کن کصکش:",
    "vip_extension": "تمدید سرویس اختصاصی",
    "iphone_extension": "تمدید سرویس آیفون",
    "help_use": "📚آموزش استفاده",
    "help_use_text": """در کانال زیر آموزش های نحوه فعالسازی اشتراک  رو مشاهده کنید.

@SPEEDCONNECT_HELPUSER

در صورتی که هر زمان مشکلی در اتصال داشتید با پشتیبانی هماهنگ باشید.""",
    "up_user_inventory": "💰 افزایش موجودی",
}


async def join_check(user_id, cli):
    get_info = await cli.get_entity(PeerChannel(1778853564))
    TELEGRAM_API_URL = f"https://api.telegram.org/bot{BOT_TOKEN}/getChatMember?chat_id=-1001778853564&user_id={user_id}"
    response = requests.post(TELEGRAM_API_URL)
    response = response.json()
    print(response)
    response = response.get("ok")
    return response, get_info


def is_iran_phone_number(phone_number):
    print(phone_number)
    if phone_number.startswith('+98') or phone_number.startswith("98"):
        return True
    else:
        return False


def is_ban(user_id):
    db = connect("bot.db")
    cur = db.cursor()
    user_is_ban = cur.execute(f"SELECT is_ban FROM users WHERE user_id = {user_id}").fetchone()
    if user_is_ban == None:
        return None
    else:
        return user_is_ban[0]
    db.close()
    return user_is_ban


plan_names = {
    2: "یکماهه تک کاربره اقتصادی 20 گیگ 60 تومن",
    3: "نامحدود یک ماهه تک کاربره 120،000 تومان",
    4: "نامحدود دو ماهه تک کاربره 190،000 تومان",
    5: "نامحدود سه ماهه تک کاربره 290،000 تومان",
    6: "نامحدود یک ماهه دو کاربره 180،000 تومان",
    7: "نامحدود دو ماهه دو کاربره 270،000 تومان",
    8: "نامحدود سه ماهه دو کاربره 360،000 تومانن",
    9: "نامحدود یک ماهه سه کاربره 280 تومان",
    10: "نامحدود دو ماهه سه کاربره 370 تومان",
    11: "نامحدود سه ماهه سه کاربره 440 تومان"
}
one_member_names = {
    2: "یکماهه تک کاربره اقتصادی 20 گیگ 60 تومن",
    3: "نامحدود یک ماهه تک کاربره 120،000 تومان",
    4: "نامحدود دو ماهه تک کاربره 190،000 تومان",
    5: "نامحدود سه ماهه تک کاربره 290،000 تومان",
}

two_member_names = {
    6: "نامحدود یک ماهه دو کاربره 180،000 تومان",
    7: "نامحدود دو ماهه دو کاربره 270،000 تومان",
    8: "نامحدود سه ماهه دو کاربره 360،000 تومانن",
}

three_member_names = {
    9: "نامحدود یک ماهه سه کاربره 280 تومان",
    10: "نامحدود دو ماهه سه کاربره 370 تومان",
    11: "نامحدود سه ماهه سه کاربره 440 تومان"
}

one_member_namesـiphone = {
    2: "نامحدود - یک ماهه - 90 هزار تومن",
    3: "نامحدود - دو ماهه - 165 هزار تومن",
    4: "نامحدود - سه ماهه - 240 هزار تومن"
}

two_member_names_iphone = {
    5: "نامحدود - یک ماهه - 170 هزار تومن",
    6: "نامحدود - دو ماهه - 330 هزار تومن",
    7: "نامحدود - سه ماهه - 395 هزار تومن"
}

three_member_names_iphone = {
    8: "نامحدود - یک ماهه - 270 هزار تومن",
    9: "نامحدود - دو ماهه - 415 هزار تومن",
    10: "نامحدود - سه ماهه - 485 هزار تومن",
}

amounts = {
    2: 60000,
    3: 120000,
    4: 190000,
    5: 290000,
    6: 180000,
    7: 270000,
    8: 360000,
    9: 280000,
    10: 370000,
    11: 440000,
}

iphone_amounts = {
    2: 90000,
    3: 165000,
    4: 240000,
    5: 170000,
    6: 330000,
    7: 395000,
    8: 270000,
    9: 415000,
    10: 485000,
}

iphone_data_limits = {2: 536870912000, 3: 536870912000, 4: 536870912000, 5: 536870912000, 6: 536870912000,
                      7: 536870912000, 8: 536870912000, 9: 536870912000, 10: 536870912000}

iphone_plan_names = {
    2: "نامحدود - یک ماهه - 90 هزار تومن",
    3: "نامحدود - دو ماهه - 165 هزار تومن",
    4: "نامحدود - سه ماهه - 240 هزار تومن",
    5: "نامحدود - یک ماهه - 170 هزار تومن",
    6: "نامحدود - دو ماهه - 330 هزار تومن",
    7: "نامحدود - سه ماهه - 395 هزار تومن",
    8: "نامحدود - یک ماهه - 270 هزار تومن",
    9: "نامحدود - دو ماهه - 415 هزار تومن",
    10: "نامحدود - سه ماهه - 485 هزار تومن",
}

iphone_expire_dates = {
    2: 30,
    3: 60,
    4: 90,
    5: 30,
    6: 60,
    7: 90,
    8: 30,
    9: 60,
    10: 90,
}

plans_json = {1: 'a5fda1ba-fccf-4215-b2ad-1b15d120b2ce', 2: '1eb4badb-fa8b-41ae-bbed-810afd8d4195',
              3: '662f7238-064e-49ab-9d6b-8b1bbcfce331', 4: 'f64fe3ed-bf2a-41b2-b874-3b57191ee95c',
              5: '263eed65-5bbe-4d9c-af29-119474cae071', 6: '69e09847-7570-4487-bedb-2e6f268b6544',
              7: '1233d684-d0a5-43f9-a099-804fbcea318f', 8: 'cc82fa37-03aa-4174-97ac-96417e5c0859',
              9: '762d16f1-a0cf-4212-b100-acfdd0568499', 10: '6ef8b059-ae1c-406c-aa89-9e6a9dbe3674',
              11: 'ce238760-6daf-4bec-a5df-bcc25b4cb9bf'}
expire_dates = {
    2: 30,
    3: 30,
    4: 60,
    5: 90,
    6: 30,
    7: 60,
    8: 90,
    9: 30,
    10: 60,
    11: 90,
}
data_limits = {
    2: 20,
    3: 500,
    4: 500,
    5: 500,
    6: 500,
    7: 500,
    8: 500,
    9: 500,
    10: 500,
    11: 500,
}
